
       <div class="breadcrumbs">
            <div class="col-sm-1300">
                <div class="page-header float-left">
                    <div class="page-title">
                         <center><h4>---------------------- เหตุการณ์ที่เกิดขึ้นพร้อมกันบ่อยประจำปี พ.ศ.2560 (support) ----------------------</h4></center>
                    </div>
                </div>
            </div>
            <div class="col-sm-1000">
                <div class="page-header float-right">
                    <div class="page-title">
                    </div>
                </div>
            </div>
            </div>

<script src="https://code.highcharts.com/highcharts.js"></script>
<script src="https://code.highcharts.com/modules/data.js"></script>
<script src="https://code.highcharts.com/modules/drilldown.js"></script>

<div id="container" style="min-width: 310px; height: 500px; margin: 0 auto"></div>

<script src="https://code.highcharts.com/modules/exporting.js"></script>

<div id="container3" style="min-width: 310px; height: 500px; margin: 0 auto"></div>
<div id="container4" style="min-width: 310px; height: 500px; margin: 0 auto"></div>

<script type="text/javascript">


Highcharts.chart('container', {
    chart: {
        type: 'column'
    },
    title: {
    text: 'อุบัติเหตุรถจักรยานยนต์ล้มที่มีปัจจัยร่วมกัน 5 เหตุการณ์'
    },
    subtitle: {
	
    },
    xAxis: {
        type: 'category'
    },
    yAxis: {
        title: {
            text: 'จำนวนครั้งในการเกิดขึ้นพร้อมกัน - บนแท่งกราฟแสดง %'
        }

    },
    legend: {
        enabled: false
    },
    plotOptions: {
        series: {
            borderWidth: 0,
            dataLabels: {
                enabled: true,
                format: '{point.y:.100f}%'
            }
        }
    },

    tooltip: {
        headerFormat: '<span style="font-size:11px">{series.name}</span><br>',
        pointFormat: '<span style="color:{point.color}">{point.name}</span>: <b>{point.y:.2f}%</b> of total<br/>'
    },

    "series": [
        {
            "name": "Browsers",
            "colorByPoint": true,
            "data": [
            	{
                    "name": "รถจักรยานยนต์ล้ม,ผู้ชาย",
                    "y": 25,
                    "drilldown": "รถจักรยานยนต์ล้ม,ผู้ชาย"
                },
                {
                    "name": "รถจักรยานยนต์ล้ม,ผู้หญิง",
                    "y": 53,
                    "drilldown": "รถจักรยานยนต์ล้ม,ผู้หญิง"
                },
                {
                    "name": "รถจักรยานยนต์ล้ม,วันธรรมดา",
                    "y": 49,
                    "drilldown": "รถจักรยานยนต์ล้ม,วันธรรมดา"
                },
                {
                    "name": "รถจักรยานยนต์ล้ม,เข่า",
                    "y": 37,
                    "drilldown": "รถจักรยานยนต์ล้ม,เข่า"
                },
                {
                    "name": "รถจักรยานยนต์ล้ม,หน้ามหาวิทยาลัย",
                    "y": 26,
                    "drilldown": "รถจักรยานยนต์ล้ม,หน้ามหาวิทยาลัย"
                },
                /*
                {
                    "name": "รถจักรยานยนต์ชนรถบรรทุก",
                    "y": 3,
                    "drilldown": "รถจักรยานยนต์ชนรถบรรทุก"
                },
                {
                    "name": "รถจักรยานยนต์ชนสัตว์",
                    "y": 5,
                    "drilldown": "รถจักรยานยนต์ชนสัตว์"
                }*/
            ]
        }
    ],
    "drilldown": {
        "series": [
            {
                "name": "ถนนหน้ามหาวิทยาลัย",
                "id": "ถนนหน้ามหาวิทยาลัย",
                "data": [
                    [
                        "v65.0",
                        0.1
                    ],
                    [
                        "v64.0",
                        1.3
                    ],
                    [
                        "v100.0",
                        53.02
                    ],
                    [
                        "v62.0",
                        1.4
                    ],
                    [
                        "v61.0",
                        0.88
                    ],
                    [
                        "v60.0",
                        0.56
                    ],
                    [
                        "v59.0",
                        0.45
                    ],
                    [
                        "v58.0",
                        0.49
                    ],
                    [
                        "v57.0",
                        0.32
                    ],
                    [
                        "v56.0",
                        0.29
                    ],
                    [
                        "v55.0",
                        0.79
                    ],
                    [
                        "v54.0",
                        0.18
                    ],
                    [
                        "v51.0",
                        0.13
                    ],
                    [
                        "v49.0",
                        2.16
                    ],
                    [
                        "v48.0",
                        0.13
                    ],
                    [
                        "v47.0",
                        0.11
                    ],
                    [
                        "v43.0",
                        0.17
                    ],
                    [
                        "v29.0",
                        0.26
                    ]
                ]
            },
            {
                "name": "ถนนหน้าโรงพยาบาลท่าศาลา",
                "id": "ถนนหน้าโรงพยาบาลท่าศาลา",
                "data": [
                    [
                        "v58.0",
                        1.02
                    ],
                    [
                        "v57.0",
                        7.36
                    ],
                    [
                        "v56.0",
                        0.35
                    ],
                    [
                        "v55.0",
                        0.11
                    ],
                    [
                        "v54.0",
                        0.1
                    ],
                    [
                        "v52.0",
                        0.95
                    ],
                    [
                        "v51.0",
                        0.15
                    ],
                    [
                        "v50.0",
                        0.1
                    ],
                    [
                        "v48.0",
                        0.31
                    ],
                    [
                        "v47.0",
                        0.12
                    ]
                ]
            },
            {
                "name": "อาคารคอมพิวเตอร์",
                "id": "อาคารคอมพิวเตอร์",
                "data": [
                    [
                        "v11.0",
                        6.2
                    ],
                    [
                        "v10.0",
                        0.29
                    ],
                    [
                        "v9.0",
                        0.27
                    ],
                    [
                        "v8.0",
                        0.47
                    ]
                ]
            },
            {
                "name": "อาคารวิชาการ5",
                "id": "อาคารวิชาการ5",
                "data": [
                    [
                        "v11.0",
                        3.39
                    ],
                    [
                        "v10.1",
                        0.96
                    ],
                    [
                        "v10.0",
                        0.36
                    ],
                    [
                        "v9.1",
                        0.54
                    ],
                    [
                        "v9.0",
                        0.13
                    ],
                    [
                        "v5.1",
                        0.2
                    ]
                ]
            },
            {
                "name": "โรงอาหาร4",
                "id": "โรงอาหาร4",
                "data": [
                    [
                        "v16",
                        2.6
                    ],
                    [
                        "v15",
                        0.92
                    ],
                    [
                        "v14",
                        0.4
                    ],
                    [
                        "v13",
                        0.1
                    ]
                ]
            },
            {
                "name": "โรงอาหาร 2",
                "id": "โรงอาหาร 2",
                "data": [
                    [
                        "v50.0",
                        0.96
                    ],
                    [
                        "v49.0",
                        0.82
                    ],
                    [
                        "v12.1",
                        0.14
                    ]
                ]
            },
            {
                "name": "อาคารเครื่องมือ 3",
                "id": "อาคารเครื่องมือ 3",
                "data": [
                    [
                        "v50.0",
                        0.96
                    ],
                    [
                        "v49.0",
                        0.82
                    ],
                    [
                        "v12.1",
                        0.14
                    ]
                ]
            }
            
        ]
    }
});



Highcharts.chart('container3', {
    chart: {
        type: 'column'
    },
    title: {
    text: 'อุบัติเหตุทางจราจรที่มีปัจจัยร่วมกับกลุ่มอวัยวะแขนและขา 5 เหตุการณื'
    },
    subtitle: {
	
    },
    xAxis: {
        type: 'category'
    },
    yAxis: {
        title: {
            text: 'จำนวนครั้งในการเกิดขึ้นพร้อมกัน - บนแท่งกราฟแสดง %'
        }

    },
    legend: {
        enabled: false
    },
    plotOptions: {
        series: {
            borderWidth: 0,
            dataLabels: {
                enabled: true,
                format: '{point.y:100f}%'
            }
        }
    },

    tooltip: {
        headerFormat: '<span style="font-size:11px">{series.name}</span><br>',
        pointFormat: '<span style="color:{point.color}">{point.name}</span>: <b>{point.y:.2f}%</b> of total<br/>'
    },

    "series": [
        {
            "name": "Browsers",
            "colorByPoint": true,
            "data": [
                {
                    "name": "กลุ่มอวัยวะแขนและขา,รถจักรยานยนต์ล้ม",
                    "y": 71,
                    "drilldown": "กลุ่มอวัยวะแขนและขา,รถจักรยานยนต์ล้ม"
                },
                {
                    "name": "กลุ่มอวัยวะแขนและขา,ผู้หญิง",
                    "y": 62,
                    "drilldown": "กลุ่มอวัยวะแขนและขา,ผู้หญิง"
                },
                {
                    "name": "กลุ่มอวัยวะแขนและขา,บาดเจ็บเล็กน้อย",
                    "y": 62,
                    "drilldown": "กลุ่มอวัยวะแขนและขา,ผู้หญิง"
                },
                {
                    "name": "กลุ่มอวัยวะแขนและขา,วันธรรมดา",
                    "y": 61,
                    "drilldown": "กลุ่มอวัยวะแขนและขา,วันธรรมดา"
                },
                {
                    "name": "กลุ่มอวัยวะแขนและขา,ชั้นปีที่ 1",
                    "y": 40,
                    "drilldown": "กลุ่มอวัยวะแขนและขา,ชั้นปีที่ 1"
                },
                /*{
                    "name": "อาคารเครื่องมือ 8",
                    "y": 43,
                    "drilldown": "อาคารเครื่องมือ 8"
                },
                {
                    "name": "อาคารกีฬาในร่ม",
                    "y": 30,
                    "drilldown": "อาคารกีฬาในร่ม"
                },
                {
                    "name": "โรงอาหารกลางคืน",
                    "y": 32,
                    "drilldown": "โรงอาหารกลางคืน"
                },
                {
                    "name": "ถนนหน้ามหาวิทยาลัย",
                    "y": 20,
                    "drilldown": "ถนนหน้ามหาวิทยาลัย"
                },
                {
                    "name": "ถนนหน้าโรงพยาบาลท่าศาลา",
                    "y": 10,
                    "drilldown": "ถนนหน้าโรงพยาบาลท่าศาลา"
                }*/
            ]
        }
    ],
    "drilldown": {
        "series": [
            {
                "name": "ถนนหน้ามหาวิทยาลัย",
                "id": "ถนนหน้ามหาวิทยาลัย",
                "data": [
                    [
                        "v65.0",
                        0.1
                    ],
                    [
                        "v64.0",
                        1.3
                    ],
                    [
                        "v100.0",
                        53.02
                    ],
                    [
                        "v62.0",
                        1.4
                    ],
                    [
                        "v61.0",
                        0.88
                    ],
                    [
                        "v60.0",
                        0.56
                    ],
                    [
                        "v59.0",
                        0.45
                    ],
                    [
                        "v58.0",
                        0.49
                    ],
                    [
                        "v57.0",
                        0.32
                    ],
                    [
                        "v56.0",
                        0.29
                    ],
                    [
                        "v55.0",
                        0.79
                    ],
                    [
                        "v54.0",
                        0.18
                    ],
                    [
                        "v51.0",
                        0.13
                    ],
                    [
                        "v49.0",
                        2.16
                    ],
                    [
                        "v48.0",
                        0.13
                    ],
                    [
                        "v47.0",
                        0.11
                    ],
                    [
                        "v43.0",
                        0.17
                    ],
                    [
                        "v29.0",
                        0.26
                    ]
                ]
            },
            {
                "name": "ถนนหน้าโรงพยาบาลท่าศาลา",
                "id": "ถนนหน้าโรงพยาบาลท่าศาลา",
                "data": [
                    [
                        "v58.0",
                        1.02
                    ],
                    [
                        "v57.0",
                        7.36
                    ],
                    [
                        "v56.0",
                        0.35
                    ],
                    [
                        "v55.0",
                        0.11
                    ],
                    [
                        "v54.0",
                        0.1
                    ],
                    [
                        "v52.0",
                        0.95
                    ],
                    [
                        "v51.0",
                        0.15
                    ],
                    [
                        "v50.0",
                        0.1
                    ],
                    [
                        "v48.0",
                        0.31
                    ],
                    [
                        "v47.0",
                        0.12
                    ]
                ]
            },
            {
                "name": "อาคารคอมพิวเตอร์",
                "id": "อาคารคอมพิวเตอร์",
                "data": [
                    [
                        "v11.0",
                        6.2
                    ],
                    [
                        "v10.0",
                        0.29
                    ],
                    [
                        "v9.0",
                        0.27
                    ],
                    [
                        "v8.0",
                        0.47
                    ]
                ]
            },
            {
                "name": "อาคารวิชาการ5",
                "id": "อาคารวิชาการ5",
                "data": [
                    [
                        "v11.0",
                        3.39
                    ],
                    [
                        "v10.1",
                        0.96
                    ],
                    [
                        "v10.0",
                        0.36
                    ],
                    [
                        "v9.1",
                        0.54
                    ],
                    [
                        "v9.0",
                        0.13
                    ],
                    [
                        "v5.1",
                        0.2
                    ]
                ]
            },
            {
                "name": "โรงอาหาร4",
                "id": "โรงอาหาร4",
                "data": [
                    [
                        "v16",
                        2.6
                    ],
                    [
                        "v15",
                        0.92
                    ],
                    [
                        "v14",
                        0.4
                    ],
                    [
                        "v13",
                        0.1
                    ]
                ]
            },
            {
                "name": "โรงอาหาร 2",
                "id": "โรงอาหาร 2",
                "data": [
                    [
                        "v50.0",
                        0.96
                    ],
                    [
                        "v49.0",
                        0.82
                    ],
                    [
                        "v12.1",
                        0.14
                    ]
                ]
            },
            {
                "name": "อาคารเครื่องมือ 3",
                "id": "อาคารเครื่องมือ 3",
                "data": [
                    [
                        "v50.0",
                        0.96
                    ],
                    [
                        "v49.0",
                        0.82
                    ],
                    [
                        "v12.1",
                        0.14
                    ]
                ]
            }
            
        ]
    }
});

Highcharts.chart('container4', {
    chart: {
        type: 'column'
    },
    title: {
    text: 'ความรุนแรงจากอุบัติเหตุทางจราจรที่มีปัจจัยร่วม 5 เหตุการณ์'
    },
    subtitle: {
	
    },
    xAxis: {
        type: 'category'
    },
    yAxis: {
        title: {
            text: 'จำนวนครั้งในการเกิดขึ้นพร้อมกัน - บนแท่งกราฟแสดง %'
        }

    },
    legend: {
        enabled: false
    },
    plotOptions: {
        series: {
            borderWidth: 0,
            dataLabels: {
                enabled: true,
                format: '{point.y:.1f}%'
            }
        }
    },

    tooltip: {
        headerFormat: '<span style="font-size:11px">{series.name}</span><br>',
        pointFormat: '<span style="color:{point.color}">{point.name}</span>: <b>{point.y:.2f}%</b> of total<br/>'
    },

    "series": [
        {
            "name": "Browsers",
            "colorByPoint": true,
            "data": [
                {
                    "name": "บาดเจ็บเล็กน้อย,วันธรรมดา ",
                    "y": 45,
                    "drilldown": "บาดเจ็บเล็กน้อย,วันธรรมดา "
                },
                {
                    "name": "บาดเจ็บเล็กน้อย,ชั้นปีที่ 1",
                    "y": 30,
                    "drilldown": "บาดเจ็บเล็กน้อย,ชั้นปีที่ 1"
                },
                {
                    "name": "บาดเจ็บเล็กน้อย,สวมหมวกนิรภัย ",
                    "y": 21,
                    "drilldown": "บาดเจ็บเล็กน้อย,สวมหมวกนิรภัย "
                },
                {
                    "name": "บาดเจ็บเล็กน้อย,ถนนหน้ามหาวิทยาลัย",
                    "y": 21,
                    "drilldown": "บาดเจ็บเล็กน้อย,ถนนหน้ามหาวิทยาลัย"
                },
                {
                    "name": "บาดเจ็บเล็กน้อย,ผู้ชาย",
                    "y": 20,
                    "drilldown": "บาดเจ็บเล็กน้อย,ผู้ชาย "
                }
            ]
        }
    ],
    "drilldown": {
        "series": [
            {
                "name": "ถนนหน้ามหาวิทยาลัย",
                "id": "ถนนหน้ามหาวิทยาลัย",
                "data": [
                    [
                        "v65.0",
                        0.1
                    ],
                    [
                        "v64.0",
                        1.3
                    ],
                    [
                        "v100.0",
                        53.02
                    ],
                    [
                        "v62.0",
                        1.4
                    ],
                    [
                        "v61.0",
                        0.88
                    ],
                    [
                        "v60.0",
                        0.56
                    ],
                    [
                        "v59.0",
                        0.45
                    ],
                    [
                        "v58.0",
                        0.49
                    ],
                    [
                        "v57.0",
                        0.32
                    ],
                    [
                        "v56.0",
                        0.29
                    ],
                    [
                        "v55.0",
                        0.79
                    ],
                    [
                        "v54.0",
                        0.18
                    ],
                    [
                        "v51.0",
                        0.13
                    ],
                    [
                        "v49.0",
                        2.16
                    ],
                    [
                        "v48.0",
                        0.13
                    ],
                    [
                        "v47.0",
                        0.11
                    ],
                    [
                        "v43.0",
                        0.17
                    ],
                    [
                        "v29.0",
                        0.26
                    ]
                ]
            },
            {
                "name": "ถนนหน้าโรงพยาบาลท่าศาลา",
                "id": "ถนนหน้าโรงพยาบาลท่าศาลา",
                "data": [
                    [
                        "v58.0",
                        1.02
                    ],
                    [
                        "v57.0",
                        7.36
                    ],
                    [
                        "v56.0",
                        0.35
                    ],
                    [
                        "v55.0",
                        0.11
                    ],
                    [
                        "v54.0",
                        0.1
                    ],
                    [
                        "v52.0",
                        0.95
                    ],
                    [
                        "v51.0",
                        0.15
                    ],
                    [
                        "v50.0",
                        0.1
                    ],
                    [
                        "v48.0",
                        0.31
                    ],
                    [
                        "v47.0",
                        0.12
                    ]
                ]
            },
            {
                "name": "อาคารคอมพิวเตอร์",
                "id": "อาคารคอมพิวเตอร์",
                "data": [
                    [
                        "v11.0",
                        6.2
                    ],
                    [
                        "v10.0",
                        0.29
                    ],
                    [
                        "v9.0",
                        0.27
                    ],
                    [
                        "v8.0",
                        0.47
                    ]
                ]
            },
            {
                "name": "อาคารวิชาการ5",
                "id": "อาคารวิชาการ5",
                "data": [
                    [
                        "v11.0",
                        3.39
                    ],
                    [
                        "v10.1",
                        0.96
                    ],
                    [
                        "v10.0",
                        0.36
                    ],
                    [
                        "v9.1",
                        0.54
                    ],
                    [
                        "v9.0",
                        0.13
                    ],
                    [
                        "v5.1",
                        0.2
                    ]
                ]
            },
            {
                "name": "โรงอาหาร4",
                "id": "โรงอาหาร4",
                "data": [
                    [
                        "v16",
                        2.6
                    ],
                    [
                        "v15",
                        0.92
                    ],
                    [
                        "v14",
                        0.4
                    ],
                    [
                        "v13",
                        0.1
                    ]
                ]
            },
            {
                "name": "โรงอาหาร 2",
                "id": "โรงอาหาร 2",
                "data": [
                    [
                        "v50.0",
                        0.96
                    ],
                    [
                        "v49.0",
                        0.82
                    ],
                    [
                        "v12.1",
                        0.14
                    ]
                ]
            },
            {
                "name": "อาคารเครื่องมือ 3",
                "id": "อาคารเครื่องมือ 3",
                "data": [
                    [
                        "v50.0",
                        0.96
                    ],
                    [
                        "v49.0",
                        0.82
                    ],
                    [
                        "v12.1",
                        0.14
                    ]
                ]
            }
            
        ]
    }
});

</script>